Repository: studiovisual/auto-post-for-twitter
Catalog: languages/*-twitter-*.po
Languages: pt_br

source: Automatically post on Twitter when publishing a new post on WordPress.
pt_br: Publique automaticamente no Twitter ao publicar um novo post no WordPress.

source: Documentation
pt_br: Documentação

source: Activate
pt_br: Ativar

source: Post types
pt_br: Tipos de post

source: Categories
pt_br: Categorias

source: You need to fill the field %s
pt_br: Você precisa preencher o campo %s

source: Your options have been saved.
pt_br: Suas opções foram salvas.

source: Your logs have been deleted.
pt_br: Seus logs foram excluídos.

source: failed
pt_br: falhou

source: success
pt_br: sucesso

source: Not sent cause it's in a blocked category | Categories:
pt_br: Não enviado por estar em categoria bloqueada | Categoria(s):

source: Not sent cause it's in a blocked post Type | Post Type:
pt_br: Não enviado por estar em tipo de post bloqueado | Tipo de post:

source: How to get Api Twitter access
pt_br: Como obter acesso à API do Twitter

source: Step 1: Sign up to get a developer account
pt_br: Passo 1: Cadastre-se para obter uma conta de desenvolvedor

source: The developer accounts signup is easy and quickly!
pt_br: O cadastro para uma conta de desenvolvedor é rápido e fácil!

source: Step 2: Save your app key and tokens and keep them safe
pt_br: Passo 2: Salve a chave e os tokens do seu aplicativo e mantenha-os seguros

source: Once you have access and have created a project and application, you can find or generate the following credentials within your developer application:
pt_br: Assim que você tiver acesso e tiver criado um projeto e um aplicativo, você poderá encontrar ou gerar as seguintes credenciais dentro do seu aplicativo de desenvolvedor:

source: API Key and Secret: Essentially your application's username and password. You will use this data to authenticate requests that require OAuth 1.0a User Context or to generate other tokens such as user access tokens or application access tokens.
pt_br: API Key e Secret: Essencialmente, o nome de usuário e a senha do seu aplicativo. Você usará esses dados para autenticar solicitações que exigem o Contexto do Usuário OAuth 1.0a ou para gerar outros tokens, como tokens de acesso do usuário ou token de acesso do aplicativo.

source: Access Token and Secret: Access Tokens generally represent the user on whose behalf you are making the request. Tokens that you can generate through the developer portal represent the user who owns the app. You will use this data to authenticate requests that require OAuth 1.0a User Context. If you want to make requests on behalf of another user, you'll need to use OAuth's two factor's authentication flow to get them to authorize you.
pt_br: Access Token e Secret: Em geral, os Access Tokens representam o usuário em nome do qual você está fazendo a solicitação. Os tokens que você pode gerar por meio do portal de desenvolvedores representam o usuário que é proprietário do aplicativo. Você usará esses dados para autenticar solicitações que exigem o Contexto do Usuário OAuth 1.0a. Se você deseja fazer solicitações em nome de outro usuário, precisará usar o fluxo de autenticação de 3 etapas do OAuth para que eles autorizem você.

source: Client ID and Client Secret: These credentials are used to obtain an Access Token from the user with OAuth 2.0 authentication. Similar to OAuth 1.0a, user Access Tokens are used to authenticate requests that provide private user account information or perform actions on behalf of another account, but are verbose scoped for greater control over the access the client application has to the user.
pt_br: Client ID e Client Secret: Essas credenciais são usadas para obter um Access Token do usuário com autenticação OAuth 2.0. Semelhante ao OAuth 1.0a, os Access Tokens do usuário são usados para autenticar solicitações que fornecem informações privadas da conta do usuário ou executam ações em nome de outra conta, mas com escopo detalhado para um controle maior sobre o acesso que o aplicativo do cliente tem ao usuário.

source: App only Access Token: You will use this token when making requests to endpoints that respond with publicly available information on Twitter.
pt_br: App only Access Token: Você usará esse token ao fazer solicitações para pontos de extremidade que respondem com informações disponíveis publicamente no Twitter.

source: Since these keys and tokens do not expire unless regenerated, we suggest that you save them in a safe place, such as a password manager, once you receive your credentials.
pt_br: Já que essas chaves e tokens não expiram, a menos que sejam regenerados, sugerimos que você os salve em um local seguro, como um gerenciador de senhas, assim que receber suas credenciais.

source: Step 3: Copy your generated keys
pt_br: Passo 3: Copiar as sua chaves geradas

source: Now you just have to insert your keys on the corresponding fields on the
pt_br: Agora basta inserir suas chaves nos campos correspondentes na

source: Settings
pt_br: Configurações

source: plugin settings
pt_br: configuração do plugin

source: and make your customizations.
pt_br: e fazer suas customizações.

source: Here you can follow the publications logs
pt_br: Aqui você pode acompanhar os logs das publicações

source: Clear logs
pt_br: Limpar logs

source: Post ID
pt_br: ID do post

source: Date
pt_br: Data

source: Details
pt_br: Detalhes

source: Log's not found
pt_br: Nenhum log encontrado

source: Publish on Twitter?
pt_br: Publicar no Twitter?

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Alternative title
pt_br: Título alternativo

source: Choose the post types that should be *included*:
pt_br: Escolha os tipos de posts que deverão ser *inclusos*:

source: Select the categories you *don't* want to be automatically published on Twitter
pt_br: Selecione as categorias que você *não* quer que sejam publicadas automaticamente no twitter

source: If you don't know how to get your API keys, go to the documentation
pt_br: Caso não saiba como conseguir as suas chaves de Api, acesse a documentação

source: clicking here
pt_br: clicando aqui
